---
type: StructuralSectionLProfileWithLips
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionLProfileWithLips

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionLProfileWithLips | 2016 | `public StructuralSectionLProfileWithLips ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double princ` |